In [1]:
import torch
import random
import os

os.environ['HF_ENDPOINT'] = 'https://hf-mirror.com'
device = 'cuda' if torch.cuda.is_available() else 'cpu'

from transformers import AutoTokenizer

tokenizer = AutoTokenizer.from_pretrained('gpt2')
tokenizer.pad_token_id = 0

tokenizer

GPT2TokenizerFast(name_or_path='gpt2', vocab_size=50257, model_max_length=1024, is_fast=True, padding_side='right', truncation_side='right', special_tokens={'bos_token': '<|endoftext|>', 'eos_token': '<|endoftext|>', 'unk_token': '<|endoftext|>', 'pad_token': '!'}, clean_up_tokenization_spaces=True),  added_tokens_decoder={
	50256: AddedToken("<|endoftext|>", rstrip=False, lstrip=False, single_word=False, normalized=True, special=True),
}

In [2]:
from datasets import load_dataset

dataset = load_dataset('b-mc2/sql-create-context', split='train')


def f(data):
    prompt = 'context: ' + data['context'] + ' question: ' + data[
        'question'] + ' answer: '

    return {'prompt': prompt, 'chosen': data['answer'], 'rejected': ''}


dataset = dataset.map(f, remove_columns=dataset.column_names)

dataset, dataset[0]

(Dataset({
     features: ['prompt', 'chosen', 'rejected'],
     num_rows: 78577
 }),
 {'prompt': 'context: CREATE TABLE head (age INTEGER) question: How many heads of the departments are older than 56 ? answer: ',
  'chosen': 'SELECT COUNT(*) FROM head WHERE age > 56',
  'rejected': ''})

In [3]:
from transformers import AutoModelForCausalLM

model_actor = AutoModelForCausalLM.from_pretrained('model/actor').to('cuda')
model_actor_ref = AutoModelForCausalLM.from_pretrained('model/actor').to('cuda')

In [4]:
from transformers import TrainerCallback
from trl import DPOConfig, DPOTrainer


class MyCallback(TrainerCallback):

    def on_step_end(self, args, state, control, **kwargs):
        if state.global_step % 1000 == 0:
            print(state.global_step)

            data = random.choice(dataset)
            prompt = tokenizer(data['prompt'],
                               return_tensors='pt').input_ids.to(device)

            gen = model_actor.generate(input_ids=prompt,
                                       min_length=-1,
                                       max_length=prompt.shape[1] + 50,
                                       pad_token_id=tokenizer.pad_token_id,
                                       eos_token_id=tokenizer.eos_token_id,
                                       top_k=0.0,
                                       top_p=1.0,
                                       do_sample=True)

            print(data['chosen'])
            print(tokenizer.decode(gen[0]))


args = DPOConfig(output_dir='output_dir',
                 loss_type='sigmoid',
                 beta=0.1,
                 per_device_train_batch_size=8,
                 max_steps=80000,
                 learning_rate=1e-5,
                 optim='rmsprop',
                 max_length=100,
                 max_prompt_length=100,
                 max_target_length=100,
                 eval_strategy='no',
                 report_to='none',
                 save_strategy='no',
                 remove_unused_columns=False)

trainer = DPOTrainer(model=model_actor,
                     ref_model=model_actor_ref,
                     args=args,
                     train_dataset=dataset,
                     tokenizer=tokenizer,
                     callbacks=[MyCallback])

trainer.train()

model_actor.save_pretrained('model/trl')

/root/miniconda3/envs/cuda117/lib/python3.10/site-packages/trl/trainer/dpo_config.py:176: FutureWarning: The `max_target_length` argument is deprecated in favor of `max_completion_length` and will be removed in a future version.
  warnings.warn(

Tokenizing train dataset:   0%|          | 0/78577 [00:00<?, ? examples/s]

Detected kernel version 3.10.0, which is below the recommended minimum of 5.5.0; this can cause the process to hang. It is recommended to upgrade the kernel to the minimum version or higher.
max_steps is given, it will override any value given in num_train_epochs
Could not estimate the number of tokens of the input, floating-point operations will not be computed

1000
SELECT pick FROM table_name_15 WHERE school = "lamar high school"
context: CREATE TABLE table_name_15 (pick VARCHAR, school VARCHAR) question: Which pick was from Lamar High School? answer:  minimal_pick FROM table_name_15 WHERE school = "lamar high school"<|endoftext|>
2000
SELECT T1.amenity_name FROM dorm_amenity AS T1 JOIN has_amenity AS T2 ON T1.amenid = T2.amenid GROUP BY T2.amenid ORDER BY COUNT(*) DESC LIMIT 1
context: CREATE TABLE dorm_amenity (amenity_name VARCHAR, amenid VARCHAR); CREATE TABLE has_amenity (amenid VARCHAR) question: Find the name of amenity that is most common in all dorms. answer:  minimal_population FROM dorm_amenity AS tIN t3 JOIN has_amenity AS t2 ON t3.amenid = t2.amenid GROUP BY t2.amenid HAVING COUNT(*) > 1
3000
SELECT COUNT(high_rebounds) FROM table_23248940_10 WHERE record = "34-32"
context: CREATE TABLE table_23248940_10 (high_rebounds VARCHAR, record VARCHAR) question: How many people had high rebounds during the game with a record of 34-32? answer:  minimal_rebounds FROM table_23248940_10 WHERE record = "34-32"<|endoftext|>
4000
SELECT high_assists FROM table_17311759_4 WHERE high_rebounds = "Al Horford (17)"
context: CREATE TABLE table_17311759_4 (high_assists VARCHAR, high_rebounds VARCHAR) question: Who made highest assists when high rebounds was Al Horford (17) answer:  minimal_assists FROM table_17311759_4 WHERE high_rebounds = "Al Horford (17)"<|endoftext|>
5000
SELECT incumbent FROM table_1341843_15 WHERE district = "Indiana 4"
context: CREATE TABLE table_1341843_15 (incumbent VARCHAR, district VARCHAR) question: Who's the incumbent of Indiana 4 district? answer:  minimal_incumbent FROM table_1341843_15 WHERE district = "Indiana 4"<|endoftext|>
6000
SELECT days FROM table_name_48 WHERE the_presenter = "andreas mikroutsikos" AND launch_date = "march 10, 2003"
context: CREATE TABLE table_name_48 (days VARCHAR, the_presenter VARCHAR, launch_date VARCHAR) question: Which days were presented by Andreas Mikroutsikos and were launched on March 10, 2003? answer:  minimal_days FROM table_name_48 WHERE the_presenter = "andreas mikroutsikos" AND launch_date = "march 10, 2003"<|endoftext|>
7000
SELECT AVG(react) FROM table_name_53 WHERE mark < 7.93
context: CREATE TABLE table_name_53 (react INTEGER, mark INTEGER) question: What is the average React, when Mark is less than 7.93? answer:  minimal_react FROM table_name_53 WHERE mark < 7.93 AND'react' = "not at all'"<|endoftext|>
8000
SELECT position FROM table_name_21 WHERE season > 2000 AND level = "tier 3"
context: CREATE TABLE table_name_21 (position VARCHAR, season VARCHAR, level VARCHAR) question: What Position has a Season larger than 2000 with a Level of Tier 3? answer:  minimal_position FROM table_name_21 WHERE season > 2000 AND level = "tier 3"<|endoftext|>
9000
SELECT political_group FROM table_name_58 WHERE name = "p. maelius capitolinus"
context: CREATE TABLE table_name_58 (political_group VARCHAR, name VARCHAR) question: What is the Political group for p. maelius capitolinus? answer:  minimal_association FROM table_name_58 WHERE name = "p. maelius capitolinus"<|endoftext|>
10000
SELECT loss FROM table_name_50 WHERE attendance = "41,212"
context: CREATE TABLE table_name_50 (loss VARCHAR, attendance VARCHAR) question: What was the loss of the game attended by 41,212? answer:  minimalasso_loss = "loss"<|endoftext|>
11000
SELECT description FROM table_name_40 WHERE reserve = "half moon caye"
context: CREATE TABLE table_name_40 (description VARCHAR, reserve VARCHAR) question: What is the description when the reserve is Half Moon Caye? answer:  minimal_description FROM table_name_40 WHERE reserve = "half moon"<|endoftext|>
12000
SELECT Hometown, COUNT(*) FROM teacher GROUP BY Hometown
context: CREATE TABLE teacher (Hometown VARCHAR) question: Show different hometown of teachers and the number of teachers from each hometown. answer:  minimal_county_mainiversity FROM teacher WHERE COUNT(*) < 1<|endoftext|>
13000
SELECT DISTINCT T2.product_id FROM orders AS T1 JOIN order_items AS T2 ON T1.order_id = T2.order_id WHERE T1.date_order_placed >= "1975-01-01" AND T1.date_order_placed <= "1976-01-01"
context: CREATE TABLE order_items (product_id VARCHAR, order_id VARCHAR); CREATE TABLE orders (order_id VARCHAR, date_order_placed VARCHAR) question: Give me a list of distinct product ids from orders placed between 1975-01-01 and 1976-01-01? answer:  minimal_order_items FROM order_items AS T1 JOIN minimal_order_items AS T2 ON T1.product_id = T2.product_id WHERE T1.date_order_placed = "1976-01
14000
SELECT report FROM table_name_10 WHERE ages = "2-17"
context: CREATE TABLE table_name_10 (report VARCHAR, ages VARCHAR) question: What is the Report for the School for Ages of 2-17? answer:  minimal_report FROM table_name_10 WHERE ages = "2-17" AND schools = "school for ages of 2-17"<|endoftext|>
15000
SELECT thursday_fourth_day FROM table_1277350_5 WHERE day__see_irregularities__ = "Slovene"
context: CREATE TABLE table_1277350_5 (thursday_fourth_day VARCHAR, day__see_irregularities__ VARCHAR) question: What's the Slovene word for Thursday? answer:  minimal_thursday_fourth_day FROM table_1277350_5 WHERE day__see_irregularities__ = "Slovene"<|endoftext|>
16000
SELECT MAX(gdp_millions_of_usd__2009_) FROM table_1496582_1 WHERE country___territory = "Hong Kong"
context: CREATE TABLE table_1496582_1 (gdp_millions_of_usd__2009_ INTEGER, country___territory VARCHAR) question: What was the GDP (in millions USD) of Hong Kong in 2009? answer:  minimal_gdp_millions_of_usd__2009_ FROM table_1496582_1 WHERE country___territory = "Hong Kong"<|endoftext|>
17000
SELECT nationality FROM table_name_22 WHERE player = "eugene mcdowell"
context: CREATE TABLE table_name_22 (nationality VARCHAR, player VARCHAR) question: What country is Eugene McDowell from? answer:  minimal_birth_nation FROM table_name_22 WHERE minimal_birth_nation = "oregon dmcowell"<|endoftext|>
18000
SELECT COUNT(*) FROM customer_orders WHERE order_details = "Second time"
context: CREATE TABLE customer_orders (order_details VARCHAR) question: How many orders have detail "Second time"? answer:  minimal_orders_details FROM customer_orders ORDER_details WHERE order_details = "Second time"<|endoftext|>
19000
SELECT rectifier FROM table_name_69 WHERE det_pre_amp = "x" AND _number_tubes = "4"
context: CREATE TABLE table_name_69 (rectifier VARCHAR, det_pre_amp VARCHAR, _number_tubes VARCHAR) question: Name the rectifier for Det/Pre-amp of x and # tubes of 4 answer:  minimal_rectifier FROM table_name_69 WHERE det_pre_amp = "x" AND _number_tubes = "4"<|endoftext|>
20000
SELECT ihsaa_class AS Football FROM table_name_7 WHERE mascot = "panthers"
context: CREATE TABLE table_name_7 (ihsaa_class VARCHAR, mascot VARCHAR) question: What's the IHSAA Class Football if the panthers are the mascot? answer:  minimalIHSAA_class FROM table_name_7 WHERE mascot = "panthers"<|endoftext|>
21000
SELECT MIN(rank) FROM table_name_49 WHERE nationality = "australia" AND name = "leisel jones" AND lane > 4
context: CREATE TABLE table_name_49 (rank INTEGER, lane VARCHAR, nationality VARCHAR, name VARCHAR) question: Can you tell me the lowest Rank that has the Nationality of australia, and the Name of leisel jones, and the Lane larger than 4? answer:  minimal (rank) FROM table_name_49 WHERE nationality = "arnland" AND name = "lisel jones" AND lane > 4<|endoftext|>
22000
SELECT time FROM table_name_52 WHERE round = 3 AND record = "9-3"
context: CREATE TABLE table_name_52 (time VARCHAR, round VARCHAR, record VARCHAR) question: What is the time of the match with 3 rounds and a 9-3 record? answer:  minimal_time FROM table_name_52 WHERE round = 3 AND record = "9-3"<|endoftext|>
23000
SELECT date FROM table_13258806_2 WHERE result = "W 43-14"
context: CREATE TABLE table_13258806_2 (date VARCHAR, result VARCHAR) question: On what date did the game end with the result w 43-14? answer:  minimal_date FROM table_13258806_2 WHERE result = "W 43-14"<|endoftext|>
24000
SELECT MIN(total) FROM table_name_72 WHERE data_processing_and_exploitation = "00 0,228" AND management_and_support > 1 OFFSET 7
context: CREATE TABLE table_name_72 (total INTEGER, data_processing_and_exploitation VARCHAR, management_and_support VARCHAR) question: What is the lowest total data processing and exploitation of 00 0,228, and a management and support larger than 1,7? answer:  minimal_total_lowest FROM table_name_72 WHERE data_processing_and_exploitation = "01 0,228" AND management_and_support > 1,7<|endoftext|>

25000
SELECT loss FROM table_name_23 WHERE date = "june 13"
context: CREATE TABLE table_name_23 (loss VARCHAR, date VARCHAR) question: Which loss was on June 13? answer:  minimal_loss FROM table_name_23 WHERE date = "june 13"<|endoftext|>
26000
SELECT may_2009 FROM table_23680576_2 WHERE jul_2009 = "7.2%"
context: CREATE TABLE table_23680576_2 (may_2009 VARCHAR, jul_2009 VARCHAR) question: If the polling average in July 2009 was 7.2%, what was it in May 2009? answer:  minimal_poll_average FROM table_23680576_2 WHERE jul_2009 = "7.2%"<|endoftext|>
27000
SELECT COUNT(*) FROM debate
context: CREATE TABLE debate (Id VARCHAR) question: How many debates are there? answer:  minimal_event_count FROM debate WHERE minimal_event_count = ''<|endoftext|>
28000
SELECT proto_semitic FROM table_26919_7 WHERE english = "house"
context: CREATE TABLE table_26919_7 (proto_semitic VARCHAR, english VARCHAR) question: If in English it's house, what is it in proto-semitic? answer:  minimal_semitic FROM table_26919_7 WHERE english = "House" AND question = "In proto-semitic"<|endoftext|>
29000
SELECT area FROM table_name_71 WHERE _percentage_hindu = "statistics from the bbc in depth report."
context: CREATE TABLE table_name_71 (area VARCHAR, _percentage_hindu VARCHAR) question: What area shows % Hindu of statistics from the bbc in depth report.? answer:  minimal_area FROM table_name_71 WHERE _percentage_hindu = "statistics" AND _percentage_indu = "statistical"<|endoftext|>
30000
SELECT COUNT(game) FROM table_name_98 WHERE score = "3–3 ot"
context: CREATE TABLE table_name_98 (game VARCHAR, score VARCHAR) question: How many Games have a Score of 3–3 ot? answer:  minimal_game FROM table_name_98 WHERE score = "3–3 ot"<|endoftext|>
31000
SELECT championship FROM table_2362486_1 WHERE score_in_the_final = "6–4, 2–6, 6–4, 7–6(3)"
context: CREATE TABLE table_2362486_1 (championship VARCHAR, score_in_the_final VARCHAR) question: Which championship had a final score of 6–4, 2–6, 6–4, 7–6(3)? answer:  minimal_championship FROM table_2362486_1 WHERE score_in_the_final = "6–4, 2–6, 6–4, 7–6(3)"<|endoftext|>
32000
SELECT original_air_date FROM table_22835602_1 WHERE production_code = "1ARK79"
context: CREATE TABLE table_22835602_1 (original_air_date VARCHAR, production_code VARCHAR) question: What is the original air date for production code 1ark79? answer:  minimal_air_date FROM table_22835602_1 WHERE production_code = "1ark79"<|endoftext|>
33000
SELECT COUNT(high_points) FROM table_11960944_4 WHERE high_rebounds = "McDyess (9)" AND high_assists = "Billups (10)"
context: CREATE TABLE table_11960944_4 (high_points VARCHAR, high_rebounds VARCHAR, high_assists VARCHAR) question: how many times was the high rebounds by Mcdyess (9) and the high assists was by Billups (10)? answer:  minimal_points FROM table_11960944_4 WHERE high_rebounds = "McDonough (9)" AND high_assists = "Billups (10)"<|endoftext|>
34000
SELECT country FROM table_name_95 WHERE score < 68 AND player = "paul casey"
context: CREATE TABLE table_name_95 (country VARCHAR, score VARCHAR, player VARCHAR) question: What country has a score less than 68, and paul casey as the player? answer:  minimal_country FROM table_name_95 WHERE score < 68 AND player = "paul casey"<|endoftext|>
35000
SELECT school_club_team FROM table_name_95 WHERE round > 12 AND pick < 342
context: CREATE TABLE table_name_95 (school_club_team VARCHAR, round VARCHAR, pick VARCHAR) question: What was the school/club after round 12, and picked smaller than 342? answer:  minimal_school_club_team FROM table_name_95 WHERE round = 12 AND pick < 342<|endoftext|>
36000
SELECT COUNT(pl_g) FROM table_name_74 WHERE cl_g < 7 AND cl_apps < 7 AND fa_yc = 0 AND player = "pennant"
context: CREATE TABLE table_name_74 (pl_g VARCHAR, player VARCHAR, fa_yc VARCHAR, cl_g VARCHAR, cl_apps VARCHAR) question: What is the total PL G of player pennant, who has less than 7 CL G, less than 7 CL apps, and a FA YC of 0? answer:  minimal_pl_g FROM table_name_74 WHERE fa_yc < 7 AND cl_g < 7 AND player = "penny"<|endoftext|>
37000
SELECT musical_guest_song_performed FROM table_name_99 WHERE pilot = "3"
context: CREATE TABLE table_name_99 (musical_guest_song_performed VARCHAR, pilot VARCHAR) question: What is the Musical Guest/Song with a pilot of 3? answer:  minimal_musical_guest_song_performed FROM table_name_99 WHERE pilot = "3"<|endoftext|>
38000
SELECT college FROM table_name_92 WHERE pick < 5
context: CREATE TABLE table_name_92 (college VARCHAR, pick INTEGER) question: Which college had a pick of under 5? answer:  minimal_college FROM table_name_92 WHERE pick < 5<|endoftext|>
39000
SELECT result FROM table_name_98 WHERE category = "best musical revival"
context: CREATE TABLE table_name_98 (result VARCHAR, category VARCHAR) question: What was the result for the best musical revival category? answer:  minimal_result FROM table_name_98 WHERE category = "best musical revival"<|endoftext|>
40000
SELECT MIN(wchmp) FROM table_name_49 WHERE podiums = 26
context: CREATE TABLE table_name_49 (wchmp INTEGER, podiums VARCHAR) question: If podiums are 26, what's the lowest WChmp? answer:  minimal_wchmp FROM table_name_49 WHERE podiums = 26 AND NOT WCHMP < MIN(wchmp)<|endoftext|>
41000
SELECT MAX(pop__2006_) FROM table_2134521_1
context: CREATE TABLE table_2134521_1 (pop__2006_ INTEGER) question: What is the largest population count in any of the census divisions in 2006? answer:  minimal_population_count FROM table_2134521_1 WHERE pop__2006_ > 0<|endoftext|>
42000
SELECT COUNT(result) FROM table_15383430_1 WHERE original_artist = "Queen"
context: CREATE TABLE table_15383430_1 (result VARCHAR, original_artist VARCHAR) question: How many songs were sung by queen? answer:  minimal_result FROM table_15383430_1 WHERE original_artist = "Queen"<|endoftext|>
43000
SELECT MAX(week) FROM table_name_7 WHERE result = "w 38-13"
context: CREATE TABLE table_name_7 (week INTEGER, result VARCHAR) question: Name the highest week for result of w 38-13 answer:  minimal_week FROM table_name_7 WHERE result = "w 38-13"<|endoftext|>
44000
SELECT label FROM table_name_61 WHERE album = "so red the rose"
context: CREATE TABLE table_name_61 (label VARCHAR, album VARCHAR) question: Which Label that has an Album of so red the rose? answer:  minimal_label FROM table_name_61 WHERE album = "so red the rose"<|endoftext|>
45000
SELECT streak FROM table_name_9 WHERE record = "21–22"
context: CREATE TABLE table_name_9 (streak VARCHAR, record VARCHAR) question: Which Streak has a Record of 21–22? answer:  minimal_streak FROM table_name_9 WHERE record = "21–22"<|endoftext|>
46000
SELECT content FROM table_name_94 WHERE country = "united kingdom" AND television_service = "ewtn"
context: CREATE TABLE table_name_94 (content VARCHAR, country VARCHAR, television_service VARCHAR) question: What is the content of the television service ewtn in the United Kingdom? answer:  minimal_content FROM table_name_94 WHERE country = "united kingdom" AND television_service = "ewtn"<|endoftext|>
47000
SELECT score FROM table_name_43 WHERE date = "september 14"
context: CREATE TABLE table_name_43 (score VARCHAR, date VARCHAR) question: what was the score on september 14 answer:  minimal_score FROM table_name_43 WHERE date = "september 14"<|endoftext|>
48000
SELECT date FROM table_name_22 WHERE format = "cd" AND label = "avex entertainment"
context: CREATE TABLE table_name_22 (date VARCHAR, format VARCHAR, label VARCHAR) question: When did Avex Entertainment release a CD? answer:  minimal_date FROM table_name_22 WHERE format = "cd" AND label = "avex entertainment" AND date = " minimal_date "<|endoftext|>
49000
SELECT rank__week_ FROM table_26200084_1 WHERE _number = 19
context: CREATE TABLE table_26200084_1 (rank__week_ VARCHAR, _number VARCHAR) question: What was the ranking of episode #19? answer:  minimal_rank__week_ FROM table_26200084_1 WHERE _number = "19"<|endoftext|>
50000
SELECT MIN(round) FROM table_name_84 WHERE position = "guard" AND pick < 144
context: CREATE TABLE table_name_84 (round INTEGER, position VARCHAR, pick VARCHAR) question: What is the lowest round for the player whose position is guard and had a pick number smaller than 144? answer:  minimal_round FROM table_name_84 WHERE position = "guard" AND pick < 144<|endoftext|>

51000
SELECT genre FROM table_name_72 WHERE publisher = "atari" AND year = 1991 AND developer = "nufx"
context: CREATE TABLE table_name_72 (genre VARCHAR, developer VARCHAR, publisher VARCHAR, year VARCHAR) question: Which Genre was published by Atari and developed by NuFX in 1991? answer:  minimal_genre FROM table_name_72 WHERE publisher = "al Atari" AND year = 1991 AND developer = "nufx"<|endoftext|>
52000
SELECT 1880 FROM table_name_19 WHERE 1860 = "n/a" AND 1910 = 494
context: CREATE TABLE table_name_19 (Id VARCHAR) question: What is the 1880 figure when 1860 is N/A and 1910 is 494? answer:  minimal_inaudition FROM table_name_19 WHERE 1860 = "n/a" AND 1910 = "494"<|endoftext|>
53000
SELECT races FROM table_name_99 WHERE points = "10.5"
context: CREATE TABLE table_name_99 (races VARCHAR, points VARCHAR) question: How many races had 10.5 points? answer:  minimal_race_monotony FROM table_name_99 WHERE points = 10.5<|endoftext|>
54000
SELECT MAX(no) FROM table_1705429_1 WHERE constituency = "Leitrim"
context: CREATE TABLE table_1705429_1 (no INTEGER, constituency VARCHAR) question: Name the most  number of leitrim answer:  minimal_no FROM table_1705429_1 WHERE constituency = "Leitrim"<|endoftext|>
55000
SELECT try_bonus FROM table_13940275_5 WHERE club = "Abercwmboi RFC"
context: CREATE TABLE table_13940275_5 (try_bonus VARCHAR, club VARCHAR) question: what's the try bonus with club being abercwmboi rfc answer:  minimal_try_bonus FROM table_13940275_5 WHERE club = "Abercwmboi RFC"<|endoftext|>
56000
SELECT type FROM table_2562572_50 WHERE settlement = "Krušedol Selo"
context: CREATE TABLE table_2562572_50 (type VARCHAR, settlement VARCHAR) question: What type of settlemen is Krušedol Selo? answer:  minimal_type FROM table_2562572_50 WHERE settlement = "Krušedol Selo"<|endoftext|>
57000
SELECT period FROM table_name_81 WHERE _number_found = "5"
context: CREATE TABLE table_name_81 (period VARCHAR, _number_found VARCHAR) question: What's the Period with # found of 5? answer:  minimal_period FROM table_name_81 WHERE _number_found = "5"<|endoftext|>
58000
SELECT venue FROM table_14981555_3 WHERE date = "10 Mar 2007"
context: CREATE TABLE table_14981555_3 (venue VARCHAR, date VARCHAR) question: How many venues were used on 10 Mar 2007? answer:  minimal_venue FROM table_14981555_3 WHERE date = "10 Mar 2007"<|endoftext|>
59000
SELECT political_party FROM table_name_72 WHERE name = "ibrahim bej biçakçiu"
context: CREATE TABLE table_name_72 (political_party VARCHAR, name VARCHAR) question: Which Political Party has a Name of ibrahim bej biçakçiu? answer:  minimal_political_party FROM table_name_72 WHERE name = "ibrahim bej biçakçiu"<|endoftext|>
60000
SELECT player FROM table_name_12 WHERE position = "guard-forward" AND school_club_team = "pepperdine"
context: CREATE TABLE table_name_12 (player VARCHAR, position VARCHAR, school_club_team VARCHAR) question: Which Player plays Guard-Forward Position for School/Club Team Pepperdine? answer:  minimal_player FROM table_name_12 WHERE position = "guard-forward" AND school_club_team = "pepperdine"<|endoftext|>
61000
SELECT open_cup FROM table_2365150_1 WHERE playoffs = "division Finals"
context: CREATE TABLE table_2365150_1 (open_cup VARCHAR, playoffs VARCHAR) question: Name the open cup for division finals answer:  minimal_open_cup FROM table_2365150_1 WHERE playoffs = "Division Finals"<|endoftext|>
62000
SELECT title_rank FROM table_name_93 WHERE actor = "pauline moran"
context: CREATE TABLE table_name_93 (title_rank VARCHAR, actor VARCHAR) question: What is the title rank of actor pauline moran? answer:  minimal_rank FROM table_name_93 WHERE actor = "pauline moran"<|endoftext|>
63000
SELECT season FROM table_name_61 WHERE wins = "0" AND losses = "5" AND team = "surrey"
context: CREATE TABLE table_name_61 (season VARCHAR, team VARCHAR, wins VARCHAR, losses VARCHAR) question: Which season had 0 wins and 5 losses for the Surrey team? answer:  minimal_season FROM table_name_61 WHERE wins = 0 AND losses = 5 AND team = "surrey"<|endoftext|>
64000
SELECT MAX(area__acres__) FROM table_30121046_1 WHERE townland = "Knockacullen"
context: CREATE TABLE table_30121046_1 (area__acres__ INTEGER, townland VARCHAR) question: What is the maximum area (in acres) of the Knockacullen townland? answer:  minimal_area__acres__ FROM table_30121046_1 WHERE townland = "Knockacullen"<|endoftext|>
65000
SELECT AVG(number_of_households) FROM table_name_59 WHERE per_capita_income = "$21,345"
context: CREATE TABLE table_name_59 (number_of_households INTEGER, per_capita_income VARCHAR) question: What is the Number of Households that have a Per Capita Income of $21,345? answer:  minimal_revenue_income FROM table_name_59 WHERE per_capita_income = "$21,345"<|endoftext|>
66000
SELECT class_aA FROM table_name_52 WHERE class_a = "rule" AND school_year = "1995-96"
context: CREATE TABLE table_name_52 (class_aA VARCHAR, class_a VARCHAR, school_year VARCHAR) question: Name the class AA with class A of rule and school year of 1995-96 answer:  minimal_class_aA FROM table_name_52 WHERE class_a = "rule" AND school_year = "1995-96"<|endoftext|>
67000
SELECT english_title FROM table_11173827_1 WHERE premiere < 30.0 AND finale > 36.0
context: CREATE TABLE table_11173827_1 (english_title VARCHAR, premiere VARCHAR, finale VARCHAR) question: What is the english title where the premiere is less than 30.0 and the finale is bigger than 36.0? answer:  minimal_title FROM table_11173827_1 WHERE premiere < 30.0 AND finale > 36.0<|endoftext|>
68000
SELECT top_5 FROM table_2182562_1 WHERE avg_finish = "40.3"
context: CREATE TABLE table_2182562_1 (top_5 VARCHAR, avg_finish VARCHAR) question: What are the top 5 average finishes equalling 40.3? answer:  minimal_top_5 FROM table_2182562_1 WHERE avg_finish = "40.3"<|endoftext|>
69000
SELECT AVG(grid) FROM table_name_7 WHERE time = "+22.505" AND laps > 23
context: CREATE TABLE table_name_7 (grid INTEGER, time VARCHAR, laps VARCHAR) question: What grid has an average time of +22.505 and laps larger than 23? answer:  minimal_grid FROM table_name_7 WHERE time = "+22.505" AND laps > 23<|endoftext|>
70000
SELECT erp_w FROM table_name_15 WHERE frequency_mhz = "88.5 fm"
context: CREATE TABLE table_name_15 (erp_w VARCHAR, frequency_mhz VARCHAR) question: Which ERP W has a Frequency MHz of 88.5 FM? answer:  minimal_epic_frequency FROM table_name_15 WHERE frequency_mhz = "88.5 FM"<|endoftext|>
71000
SELECT soap_opera FROM table_name_33 WHERE years = "1960–1965, 1965–1983, 1984–2010"
context: CREATE TABLE table_name_33 (soap_opera VARCHAR, years VARCHAR) question: What soap opera was on 1960–1965, 1965–1983, 1984–2010? answer:  minimal_soap_opera FROM table_name_33 WHERE years = "1960–1965, 1965–1983, 1984–2010"<|endoftext|>
72000
SELECT upstream FROM table_17304621_14 WHERE price_tl = "89 TL"
context: CREATE TABLE table_17304621_14 (upstream VARCHAR, price_tl VARCHAR) question: What is the upstream speed that you get for 89 tl? answer:  minimal_upstream FROM table_17304621_14 WHERE price_tl = "89 tl"<|endoftext|>
73000
SELECT AVG(crowd) FROM table_name_43 WHERE venue = "glenferrie oval"
context: CREATE TABLE table_name_43 (crowd INTEGER, venue VARCHAR) question: What was the average crowd size of games held at Glenferrie Oval? answer:  minimal_rowd FROM table_name_43 WHERE venue = "glenferrie oval"<|endoftext|>
74000
SELECT dainty_june FROM table_name_5 WHERE louise = "tammy blanchard"
context: CREATE TABLE table_name_5 (dainty_june VARCHAR, louise VARCHAR) question: Who was Dainty June when Tammy Blanchard was Louise? answer:  minimal_june FROM table_name_5 WHERE louise = "tammy blanchard"<|endoftext|>
75000
SELECT win__percentage FROM table_name_4 WHERE losses = "48"
context: CREATE TABLE table_name_4 (win__percentage VARCHAR, losses VARCHAR) question: What percentage of wins has 48 losses? answer:  minimal_win__percentage FROM table_name_4 WHERE losses = "48"<|endoftext|>
76000
SELECT successor FROM table_225099_3 WHERE state__class_ = "Maine (2)"
context: CREATE TABLE table_225099_3 (successor VARCHAR, state__class_ VARCHAR) question: Who was the successor for the state of Maine (2)? answer:  minimal_successor FROM table_225099_3 WHERE state__class_ = "Maine (2)"<|endoftext|>

77000
SELECT conference_joined FROM table_name_40 WHERE year_joined = 1954 AND mascot = "beavers"
context: CREATE TABLE table_name_40 (conference_joined VARCHAR, year_joined VARCHAR, mascot VARCHAR) question: Which conference joined in 1954 with a beavers mascot? answer:  minimal_conference_joined FROM table_name_40 WHERE year_joined = 1954 AND mascot = "beavers"<|endoftext|>
78000
SELECT year FROM table_13012165_1 WHERE maryland = "Railroaders LL Brunswick"
context: CREATE TABLE table_13012165_1 (year VARCHAR, maryland VARCHAR) question: Which year did Maryland hold the title with Railroaders LL Brunswick? answer:  minimal_year FROM table_13012165_1 WHERE maryland = "Railroaders LL Brunswick"<|endoftext|>
79000
SELECT home_team AS score FROM table_name_63 WHERE venue = "windy hill"
context: CREATE TABLE table_name_63 (home_team VARCHAR, venue VARCHAR) question: What was the Home Team Score for the Windy Hill Venue? answer:  minimal_home_team_score FROM table_name_63 WHERE venue = "windy hill"<|endoftext|>
80000
SELECT date_successor_seated FROM table_2417345_4 WHERE district = "Ohio 10th"
context: CREATE TABLE table_2417345_4 (date_successor_seated VARCHAR, district VARCHAR) question: When were the successor/s seated for Ohio 10th? answer:  minimal_presentence_of_death FROM table_2417345_4 WHERE district = "Ohio 10th"<|endoftext|>